{
    "experiences": [
      {
        "company": "American Express",
        "positions": [
          {
            "title": "Engineer III",
            "location": "New York, NY",
            "start": "Feb 2022",
            "end": "Present",
            "description": "...",
            "achievements": []
          },
          {
            "title": "Software Engineer Intern",
            "location": "Remote",
            "start": "June 2021",
            "end": "Aug 2021",
            "description": "Part of the Global Infrastructure Developer Experience (GIDX) team which is responsible for setting and improving developer experience (DX) journeys for infrastructure products and services.",
            "achievements": [
              "Explored Infrastructure as code (IaC) solutions to determine the feasibility of creating recipes that automates deployment for developers.",
              "Developed custom terraform and crossplane providers using Go to serve as proof-of-concepts, projected to reduce deployment time by at least 90%."
            ]
          }
        ],
        "thumbnail": "amex.png",
        "class": "amex"
      },
      {
        "company": "PagerDuty",
        "positions": [
          {
            "title": "Software Developer Intern",
            "location": "Remote",
            "start": "Jan 2021",
            "end": "April 2021",
            "description": "Part of the Signal team which is responsible for Alert Grouping and Intelligent Triage products that helps responders better triage incidents for faster resolutions.",
            "achievements": [
              "Built terraform modules that provisioned AWS resources for several microservices across EU data centers.",
              "Enhanced team visibility on API usage and bugs by increasing logging and metrics monitoring via Datadog and Sumo logic.",
              "Received honorable HackWeek mention from company executives on docDuty, an initiative meant to centralize engineering documentation to increase developer productivity."
            ]
          }
        ],
        "thumbnail": "pd.png",
        "class": "pd"
      },
      {
        "company": "New York University",
        "positions": [
          {
            "title": "Web Design Tutor + Tutor Administrator",
            "location": "New York, NY",
            "start": "Oct 2019",
            "end": "Dec 2021",
            "description": "Provide tutoring for the Introduction to Web Design and Computer Principles course (CSCI-UA 4)",
            "achievements": [
              "Help students master design principles and reinforce their understanding on HTML, CSS, and JS.",
              "Provide oversight of remote tutoring and manage scheduling issues throughout the semester."
            ]
          }
        ],
        "thumbnail": "nyu.jpg",
        "class": "nyu"
      },
      {
        "company": "Girls Who Code",
        "positions": [
          {
            "title": "SIP Teaching Assistant",
            "location": "New York, NY",
            "start": "July 2018",
            "end": "Aug 2018",
            "description": "Instructor & Mentor for GWC students at MetLife",
            "achievements": [
              "Led a classroom of 20 high school girls with an interest in Computer Science by providing instruction in Scratch, Python, Web Development (HTML, CSS, JS), and Robotics (Arduino).",
              "Assisted students in their Final projects, which promotes awareness to important social issues.",
              "Helped create a positive and inclusive sisterhood in hopes of closing the gender gap in technology."
            ]
          }
        ],
        "thumbnail": "gwc.png",
        "class": "gwc"
      }
    ]
}
